Revit 2026 API

# BuiltInFailuresPlanRegionFailures Class

---

Failures about PlanRegion.

SystemObject Autodesk.Revit.DBBuiltInFailuresPlanRegionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PlanRegionFailures
```
```vb
Public NotInheritable Class PlanRegionFailures
```
```cpp
public ref class PlanRegionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PlanRegionFailures = class end
```

The BuiltInFailuresPlanRegionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DeletedViewRangeLevel | Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset? |
|  | Intersecting | The boundaries of the highlighted Plan Regions overlap. |
|  | InvalidPlanRegion | Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops. |
|  | InvalidPlanRegionError | Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops. |
|  | Nested | Cannot have nested Plan Regions. |

#### Reference

Autodesk.Revit.DB Namespace